app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)
    @address.user = current_user
    if @address.save
---
INSERT INTO "addresses" ("city", "created_at", "state", "street_name", "street_number", "updated_at", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @address.update(address_params)
---
UPDATE "addresses" SET "street_name" = $1, "street_number" = $2, "updated_at" = $3 WHERE "addresses"."id" = 165  [["street_name", "Good Street"], ["street_number", "7000"], ["updated_at", "2014-11-19 16:33:18.522213"]]

  def destroy
    @address.destroy
---
DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 170]]