app/controllers/address_controller.rb

  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save
---
INSERT INTO "addresses" ("city", "created_at", "state", "street_name", "street_number", "updated_at", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"