app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'cave@aperturelabs.com' LIMIT 1
---
  def create
    user = User.find_by(email: user_params[:email]).try(:authenticate, user_params[:password])